### Pandas Tutorial

In [1]:
import pandas as pd
import numpy as np

In [23]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['column1','column2','column3','column4'])

In [4]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [5]:
#transfer the dataFrame we made to a csv file 
df.to_csv("Test1.csv")

### acess elements

Two ways:
1. .loc
2. .iloc

In [7]:
type(df.loc['row1'])

#type is DataSeries

pandas.core.series.Series

In [8]:
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [13]:
df.iloc[0:1,0:3]

      column1  column2  column3
row1        0        1        2

In [14]:
type(df.iloc[0:1,0:3])

#type is DataFrame
##VVI
#more than 1 column makes it a Data Frame

pandas.core.frame.DataFrame

In [19]:
#converting the DataFrame to arrays

df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [21]:
#find all the null values

df.isnull()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [26]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [29]:
df1=pd.read_csv('train.csv')
df1.head(7)

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
5,18,92.93,t,b,e,c,d,g,h,s,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [31]:
df1.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [36]:
df1['X10'].value_counts()

0    4153
1      56
Name: X10, dtype: int64

In [37]:
df['column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

# CSV

In [39]:
from io import StringIO, BytesIO

In [40]:
data = ('col1,col2,col3 \n'
       'x,y,1 \n'
       'a,b,2 \n'
       'c,d,3 \n')

In [41]:
type(data)

str

In [55]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y      1
1    a    b      2
2    c    d      3

In [56]:
print(data)

col1,col2,col3
x,y,1
a,b,2
c,d,3

In [64]:
df2=pd.read_csv(StringIO(data), usecols=['col2', 'col1'])

In [67]:
df2.to_csv('Test2.csv')

In [68]:
df2.head()

  col1 col2
0    x    y
1    a    b
2    c    d

### create new data to transform it to csv

In [73]:
# my data 
data2 = ('a,b,c,d \n'
         '1,2,3,4 \n'
        '5,6,7,8 \n'
        '9,10,11,12 \n')

In [74]:
df3=pd.read_csv(StringIO(data2))

In [75]:
df3.to_csv('Test3')

In [76]:
df3.head()

   a   b   c  d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [89]:
#derive new table using this data3

df4=pd.read_csv(StringIO(data2), usecols=['a','b'])
df4.head()

   a   b
0  1   2
1  5   6
2  9  10

#### Note: Not able to use the last column in both cases.

## Modifying the index column

In [90]:
data3 = ('Qt,Fruit,Taste \n'
        '4,Apple,Good \n'
        '7,Mango,Great \n'
        '2,Banana,Bad \n')

In [91]:
#here index starts with qt,as default

pd.read_csv(StringIO(data3))

   Qt   Fruit  Taste
0   4   Apple   Good
1   7   Mango  Great
2   2  Banana    Bad

In [92]:
#we are gonna set the index to Qt as we want to start from there:

pd.read_csv(StringIO(data3), index_col=0)

     Fruit  Taste
Qt
4    Apple   Good
7    Mango  Great
2   Banana    Bad

In [96]:
pd.read_csv(StringIO(data3), usecols=['Qt','Fruit'])

   Qt   Fruit
0   4   Apple
1   7   Mango
2   2  Banana

## URL to CSV